My fist project

In [1]:
import pandas as pd
from sklearn import tree

data_train = pd.read_csv("./kaggle/input/titanic/train.csv")
data_test = pd.read_csv("./kaggle/input/titanic/test.csv")

data_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [2]:
y = data['Survived']
y.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [3]:
x = data.drop(columns=['Survived'])
x.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
from sklearn.preprocessing import LabelEncoder

lbEncoder = LabelEncoder()

lbEncoder.fit(x.Sex)
x['Sex'] = lbEncoder.transform(x.Sex)


lbEncoder.fit(x.Name)
x['Name'] = lbEncoder.transform(x.Name)

lbEncoder.fit(x.Ticket)
x['Ticket'] = lbEncoder.transform(x.Ticket)

In [5]:
x['Age'] = x['Age'].fillna(x['Age'].mean())
x

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,3,108,1,22.000000,1,0,523,7.2500,NaN,S
1,2,1,190,0,38.000000,1,0,596,71.2833,C85,C
2,3,3,353,0,26.000000,0,0,669,7.9250,NaN,S
3,4,1,272,0,35.000000,1,0,49,53.1000,C123,S
4,5,3,15,1,35.000000,0,0,472,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
886,887,2,548,1,27.000000,0,0,101,13.0000,NaN,S
887,888,1,303,0,19.000000,0,0,14,30.0000,B42,S
888,889,3,413,0,29.699118,1,2,675,23.4500,NaN,S
889,890,1,81,1,26.000000,0,0,8,30.0000,C148,C
890,891,3,220,1,32.000000,0,0,466,7.7500,NaN,Q

In [6]:
x = x.drop('Cabin',1)
x

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,1,3,108,1,22.000000,1,0,523,7.2500,S
1,2,1,190,0,38.000000,1,0,596,71.2833,C
2,3,3,353,0,26.000000,0,0,669,7.9250,S
3,4,1,272,0,35.000000,1,0,49,53.1000,S
4,5,3,15,1,35.000000,0,0,472,8.0500,S
...,...,...,...,...,...,...,...,...,...,...
886,887,2,548,1,27.000000,0,0,101,13.0000,S
887,888,1,303,0,19.000000,0,0,14,30.0000,S
888,889,3,413,0,29.699118,1,2,675,23.4500,S
889,890,1,81,1,26.000000,0,0,8,30.0000,C
890,891,3,220,1,32.000000,0,0,466,7.7500,Q

In [8]:
maxEmbarked = x.groupby('Embarked').count()['PassengerId']
tmp = maxEmbarked[maxEmbarked == maxEmbarked.max()].index[0]
x.fillna(tmp)


x['Embarked'] = x['Embarked'].astype('str')


lbEncoder.fit(x.Embarked)
x['Embarked'] = lbEncoder.transform(x.Embarked)
x

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,1,3,108,1,22.000000,1,0,523,7.2500,2
1,2,1,190,0,38.000000,1,0,596,71.2833,0
2,3,3,353,0,26.000000,0,0,669,7.9250,2
3,4,1,272,0,35.000000,1,0,49,53.1000,2
4,5,3,15,1,35.000000,0,0,472,8.0500,2
...,...,...,...,...,...,...,...,...,...,...
886,887,2,548,1,27.000000,0,0,101,13.0000,2
887,888,1,303,0,19.000000,0,0,14,30.0000,2
888,889,3,413,0,29.699118,1,2,675,23.4500,2
889,890,1,81,1,26.000000,0,0,8,30.0000,0
890,891,3,220,1,32.000000,0,0,466,7.7500,1